# ContinuousrailTransitionTypeParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousrailTransitionTypeParam Property
ParameterTypeId Class See Also
---
"Transitions"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousrailTransitionTypeParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousrailTransitionTypeParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousrailTransitionTypeParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace